[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:51:10
   // purge job
 
   const objectToAxiosParamsPurgeJobLog = () => ({
-    url: "/api/jobs/all",
+    url: "",
     method: "DELETE",
   });
killedBy: AdminJobsPage tests user can purge all jobs in the JobsTable
statusReason: expected '' to be '/api/jobs/all' // Object.is equality

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:72:67
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({});
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:82:56
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateGradeInfoJob = () => ({
-    url: "/api/jobs/launch/uploadGradeData",
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateGradeInfoJob = () => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:160:17
       form: (
         <SingleButtonJobForm
           callback={submitUpdateGradeInfoJob}
-          text={"Update Grades"}
+          text={""}
         />
       ),
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: Unable to find an element with the text: Update Grades. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:167:6
   ];
 
   const { data: page } = useBackend(
-    ["/api/jobs"],
+    [""],
     {
       method: "GET",
killedBy: AdminJobsPage tests useBackend is called with correct arguments
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/jobs' ], …(3) ]

Received:

  1st useBackend call:

@@ -1,16 +1,16 @@
  [

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:170:12
     ["/api/jobs"],
     {
       method: "GET",
-      url: "/api/jobs/paginated",
+      url: "",
       params: {
         page: selectedPage - 1,
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/pages/Admin/AdminJobsPage.jsx:172:15
       method: "GET",
       url: "/api/jobs/paginated",
       params: {
-        page: selectedPage - 1,
+        page: selectedPage + 1,
         pageSize: pageSize,
         sortField: sortField,
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: expected { page: 2, pageSize: '10', …(2) } to deeply equal { page: +0, pageSize: '10', …(2) }

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:178:16
         sortDirection: sortDirection,
       },
     },
-    { content: [], totalPages: 0 },
+    { content: ["Stryker was here"], totalPages: 0 },
     { refetchInterval: refreshJobsIntervalMilliseconds },
   );
killedBy: AdminJobsPage tests renders without crashing
statusReason: Invalid time value

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:178:5
         sortDirection: sortDirection,
       },
     },
-    { content: [], totalPages: 0 },
+    {},
     { refetchInterval: refreshJobsIntervalMilliseconds },
   );
killedBy: AdminJobsPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'length')
