[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:38:5
   }
 
   const sectionsForTable = useMemo(
-    () => convertedSectionsToPrimaryRows(courseJSON),
+    () => undefined,
     [courseJSON],
   );
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:47:63
       <div className="pt-2">
         <h5>UCSB Course History Search</h5>
         <CourseOverTimeSearchForm fetchJSON={fetchCourseOverTimeJSON} />
-        <SectionsTable sections={sectionsForTable} schedules={[]} />
+        <SectionsTable sections={sectionsForTable} schedules={["Stryker was here"]} />
       </div>
     </BasicLayout>
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: schedules prop must be an array of objects with an 'id' property
