[Killed] StringLiteral
main/pages/Admin/AdminUpdatesPage.jsx:19:5
     "ALL",
   );
   const [sortField, setSortField] = useLocalStorage(
-    "UpdatesSearch.SortField",
+    "",
     "subjectArea",
   );
killedBy: AdminUpdatesPage tests When localstorage has values, they are used
statusReason: expected { quarter: '20211', …(5) } to deeply equal { quarter: '20211', …(5) }

[Killed] StringLiteral
main/pages/Admin/AdminUpdatesPage.jsx:28:5
   );
   const [pageSize, setPageSize] = useLocalStorage(
     "UpdatesSearch.PageSize",
-    "10",
+    "",
   );
 
killedBy: AdminUpdatesPage tests When localstorage is empty, fallback values are used
statusReason: expected { quarter: 'ALL', …(5) } to deeply equal { quarter: 'ALL', …(5) }
