[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:6:45
  * same hierarchical shape as /api/public/primaries: each row has quarter, courseId,
  * title, primary (lecture section), and subRows (secondary sections).
  */
-function isLectureSectionNumber(sectionNum) {
-  if (typeof sectionNum !== "string") {
-    return false;
-  }
-  return /^\d+00$/.test(sectionNum.trim());
-}
+function isLectureSectionNumber(sectionNum) {}
 
 function groupKey(cs) {
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] EqualityOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:7:7
  * title, primary (lecture section), and subRows (secondary sections).
  */
 function isLectureSectionNumber(sectionNum) {
-  if (typeof sectionNum !== "string") {
+  if (typeof sectionNum === "string") {
     return false;
   }
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:7:7
  * title, primary (lecture section), and subRows (secondary sections).
  */
 function isLectureSectionNumber(sectionNum) {
-  if (typeof sectionNum !== "string") {
+  if (true) {
     return false;
   }
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] BooleanLiteral
src/main/utils/convertedSectionsToPrimaryRows.jsx:8:12
  */
 function isLectureSectionNumber(sectionNum) {
   if (typeof sectionNum !== "string") {
-    return false;
+    return true;
   }
   return /^\d+00$/.test(sectionNum.trim());
killedBy: convertedSectionsToPrimaryRows sort uses empty string when section number is missing
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] MethodExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:10:25
   if (typeof sectionNum !== "string") {
     return false;
   }
-  return /^\d+00$/.test(sectionNum.trim());
+  return /^\d+00$/.test(sectionNum);
 }
 
killedBy: convertedSectionsToPrimaryRows trims whitespace when detecting lecture section numbers
statusReason: expected [ { quarter: '20221', …(6) }, …(1) ] to have a length of 1 but got 2

[Killed] Regex
src/main/utils/convertedSectionsToPrimaryRows.jsx:10:10
   if (typeof sectionNum !== "string") {
     return false;
   }
-  return /^\d+00$/.test(sectionNum.trim());
+  return /^\d00$/.test(sectionNum.trim());
 }
 
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:13:23
   return /^\d+00$/.test(sectionNum.trim());
 }
 
-function groupKey(cs) {
-  return `${cs.courseInfo.quarter}|${cs.courseInfo.courseId}`;
-}
+function groupKey(cs) {}
 
 function sortWithinGroup(convertedSections) {
killedBy: convertedSectionsToPrimaryRows sorts course groups by courseId when quarter matches
statusReason: expected [ 'CMPSC   130B', 'CMPSC   130A' ] to deeply equal [ 'CMPSC   130A', 'CMPSC   130B' ]

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:17:45
   return `${cs.courseInfo.quarter}|${cs.courseInfo.courseId}`;
 }
 
-function sortWithinGroup(convertedSections) {
-  return [...convertedSections].sort((a, b) =>
-    (a.section.section ?? "").localeCompare(
-      b.section.section ?? "",
-      undefined,
-      {
-        numeric: true,
-      },
-    ),
-  );
-}
+function sortWithinGroup(convertedSections) {}
 
 export function convertedSectionsToPrimaryRows(flatConvertedSections) {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] MethodExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:18:10
 }
 
 function sortWithinGroup(convertedSections) {
-  return [...convertedSections].sort((a, b) =>
-    (a.section.section ?? "").localeCompare(
-      b.section.section ?? "",
-      undefined,
-      {
-        numeric: true,
-      },
-    ),
-  );
+  return [...convertedSections];
 }
 
killedBy: convertedSectionsToPrimaryRows sorts section numbers with numeric-aware localeCompare options
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] ArrowFunction
src/main/utils/convertedSectionsToPrimaryRows.jsx:18:38
 }
 
 function sortWithinGroup(convertedSections) {
-  return [...convertedSections].sort((a, b) =>
-    (a.section.section ?? "").localeCompare(
-      b.section.section ?? "",
-      undefined,
-      {
-        numeric: true,
-      },
-    ),
+  return [...convertedSections].sort(() => undefined,
   );
 }
killedBy: convertedSectionsToPrimaryRows sorts section numbers with numeric-aware localeCompare options
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] LogicalOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:19:6
 
 function sortWithinGroup(convertedSections) {
   return [...convertedSections].sort((a, b) =>
-    (a.section.section ?? "").localeCompare(
+    (a.section.section && "").localeCompare(
       b.section.section ?? "",
       undefined,
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] LogicalOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:20:7
 function sortWithinGroup(convertedSections) {
   return [...convertedSections].sort((a, b) =>
     (a.section.section ?? "").localeCompare(
-      b.section.section ?? "",
+      b.section.section && "",
       undefined,
       {
killedBy: convertedSectionsToPrimaryRows sorts section numbers with numeric-aware localeCompare options
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/main/utils/convertedSectionsToPrimaryRows.jsx:23:18
       b.section.section ?? "",
       undefined,
       {
-        numeric: true,
+        numeric: false,
       },
     ),
killedBy: convertedSectionsToPrimaryRows sorts section numbers with numeric-aware localeCompare options
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/main/utils/convertedSectionsToPrimaryRows.jsx:30:7
 }
 
 export function convertedSectionsToPrimaryRows(flatConvertedSections) {
-  if (!flatConvertedSections || flatConvertedSections.length === 0) {
+  if (flatConvertedSections || flatConvertedSections.length === 0) {
     return [];
   }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:30:7
 }
 
 export function convertedSectionsToPrimaryRows(flatConvertedSections) {
-  if (!flatConvertedSections || flatConvertedSections.length === 0) {
+  if (false) {
     return [];
   }
killedBy: convertedSectionsToPrimaryRows returns empty array for empty or null input
statusReason: flatConvertedSections is not iterable

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:35:43
   }
 
   const groups = new Map();
-  for (const cs of flatConvertedSections) {
-    const key = groupKey(cs);
-    if (!groups.has(key)) {
-      groups.set(key, []);
-    }
-    groups.get(key).push(cs);
-  }
+  for (const cs of flatConvertedSections) {}
 
   const sortedKeys = [...groups.keys()].sort((ka, kb) => {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:37:9
   const groups = new Map();
   for (const cs of flatConvertedSections) {
     const key = groupKey(cs);
-    if (!groups.has(key)) {
+    if (false) {
       groups.set(key, []);
     }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:37:27
   const groups = new Map();
   for (const cs of flatConvertedSections) {
     const key = groupKey(cs);
-    if (!groups.has(key)) {
-      groups.set(key, []);
-    }
+    if (!groups.has(key)) {}
     groups.get(key).push(cs);
   }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:43:58
     groups.get(key).push(cs);
   }
 
-  const sortedKeys = [...groups.keys()].sort((ka, kb) => {
-    const [qa, ca] = ka.split("|");
-    const [qb, cb] = kb.split("|");
-    if (qa !== qb) {
-      return qb.localeCompare(qa);
-    }
-    return ca.localeCompare(cb);
-  });
+  const sortedKeys = [...groups.keys()].sort((ka, kb) => {});
 
   const result = [];
killedBy: convertedSectionsToPrimaryRows sorts course groups by courseId when quarter matches
statusReason: expected [ 'CMPSC   130B', 'CMPSC   130A' ] to deeply equal [ 'CMPSC   130A', 'CMPSC   130B' ]

[Killed] MethodExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:43:22
     groups.get(key).push(cs);
   }
 
-  const sortedKeys = [...groups.keys()].sort((ka, kb) => {
-    const [qa, ca] = ka.split("|");
-    const [qb, cb] = kb.split("|");
-    if (qa !== qb) {
-      return qb.localeCompare(qa);
-    }
-    return ca.localeCompare(cb);
-  });
+  const sortedKeys = [...groups.keys()];
 
   const result = [];
killedBy: convertedSectionsToPrimaryRows sorts course groups by courseId when quarter matches
statusReason: expected [ 'CMPSC   130B', 'CMPSC   130A' ] to deeply equal [ 'CMPSC   130A', 'CMPSC   130B' ]

[Killed] EqualityOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:46:9
   const sortedKeys = [...groups.keys()].sort((ka, kb) => {
     const [qa, ca] = ka.split("|");
     const [qb, cb] = kb.split("|");
-    if (qa !== qb) {
+    if (qa === qb) {
       return qb.localeCompare(qa);
     }
killedBy: convertedSectionsToPrimaryRows sorts course groups by courseId when quarter matches
statusReason: expected [ 'CMPSC   130B', 'CMPSC   130A' ] to deeply equal [ 'CMPSC   130A', 'CMPSC   130B' ]

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:46:20
   const sortedKeys = [...groups.keys()].sort((ka, kb) => {
     const [qa, ca] = ka.split("|");
     const [qb, cb] = kb.split("|");
-    if (qa !== qb) {
-      return qb.localeCompare(qa);
-    }
+    if (qa !== qb) {}
     return ca.localeCompare(cb);
   });
killedBy: convertedSectionsToPrimaryRows sorts course groups by quarter when quarters differ
statusReason: expected [ '20221', '20222' ] to deeply equal [ '20222', '20221' ]

[Killed] ArrayDeclaration
src/main/utils/convertedSectionsToPrimaryRows.jsx:52:18
     return ca.localeCompare(cb);
   });
 
-  const result = [];
+  const result = ["Stryker was here"];
 
   for (const key of sortedKeys) {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:62:11
       const sec = cs.section;
       const info = cs.courseInfo;
 
-      if (isLectureSectionNumber(sec.section)) {
+      if (true) {
         if (currentPrimary) {
           result.push(currentPrimary);
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:62:48
       const sec = cs.section;
       const info = cs.courseInfo;
 
-      if (isLectureSectionNumber(sec.section)) {
-        if (currentPrimary) {
-          result.push(currentPrimary);
-        }
-        currentPrimary = {
-          quarter: info.quarter,
-          courseId: info.courseId,
-          title: info.title,
-          description: info.description ?? "",
-          primary: sec,
-          subRows: [],
-          generalEducation: info.generalEducation ?? [],
-        };
-      } else if (currentPrimary) {
+      if (isLectureSectionNumber(sec.section)) {} else if (currentPrimary) {
         currentPrimary.subRows.push(sec);
       } else {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:63:29
       const info = cs.courseInfo;
 
       if (isLectureSectionNumber(sec.section)) {
-        if (currentPrimary) {
-          result.push(currentPrimary);
-        }
+        if (currentPrimary) {}
         currentPrimary = {
           quarter: info.quarter,
killedBy: convertedSectionsToPrimaryRows second lecture in same course group closes prior primary row
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:63:13
       const info = cs.courseInfo;
 
       if (isLectureSectionNumber(sec.section)) {
-        if (currentPrimary) {
+        if (false) {
           result.push(currentPrimary);
         }
killedBy: convertedSectionsToPrimaryRows second lecture in same course group closes prior primary row
statusReason: expected [ { quarter: '20221', …(6) } ] to have a length of 2 but got 1

[Killed] LogicalOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:70:24
           quarter: info.quarter,
           courseId: info.courseId,
           title: info.title,
-          description: info.description ?? "",
+          description: info.description && "",
           primary: sec,
           subRows: [],
killedBy: convertedSectionsToPrimaryRows uses empty description and generalEducation when absent on courseInfo
statusReason: expected undefined to be '' // Object.is equality

[Killed] LogicalOperator
src/main/utils/convertedSectionsToPrimaryRows.jsx:73:29
           description: info.description ?? "",
           primary: sec,
           subRows: [],
-          generalEducation: info.generalEducation ?? [],
+          generalEducation: info.generalEducation && [],
         };
       } else if (currentPrimary) {
killedBy: convertedSectionsToPrimaryRows uses empty description and generalEducation when absent on courseInfo
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:75:18
           subRows: [],
           generalEducation: info.generalEducation ?? [],
         };
-      } else if (currentPrimary) {
+      } else if (false) {
         currentPrimary.subRows.push(sec);
       } else {
killedBy: convertedSectionsToPrimaryRows groups lecture with discussions for same quarter and course
statusReason: expected [ { quarter: '20221', …(6) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:75:18
           subRows: [],
           generalEducation: info.generalEducation ?? [],
         };
-      } else if (currentPrimary) {
+      } else if (true) {
         currentPrimary.subRows.push(sec);
       } else {
killedBy: convertedSectionsToPrimaryRows discussion before any lecture becomes its own primary row
statusReason: Cannot read properties of null (reading 'subRows')

[Killed] BlockStatement
src/main/utils/convertedSectionsToPrimaryRows.jsx:77:14
         };
       } else if (currentPrimary) {
         currentPrimary.subRows.push(sec);
-      } else {
-        result.push({
-          quarter: info.quarter,
-          courseId: info.courseId,
-          title: info.title,
-          description: info.description ?? "",
-          primary: sec,
-          subRows: [],
-          generalEducation: info.generalEducation ?? [],
-        });
-      }
+      } else {}
     }
 
killedBy: convertedSectionsToPrimaryRows discussion before any lecture becomes its own primary row
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/main/utils/convertedSectionsToPrimaryRows.jsx:78:21
       } else if (currentPrimary) {
         currentPrimary.subRows.push(sec);
       } else {
-        result.push({
-          quarter: info.quarter,
-          courseId: info.courseId,
-          title: info.title,
-          description: info.description ?? "",
-          primary: sec,
-          subRows: [],
-          generalEducation: info.generalEducation ?? [],
-        });
+        result.push({});
       }
     }
killedBy: convertedSectionsToPrimaryRows discussion before any lecture becomes its own primary row
statusReason: Cannot read properties of undefined (reading 'section')

[Killed] ArrayDeclaration
src/main/utils/convertedSectionsToPrimaryRows.jsx:85:54
           description: info.description ?? "",
           primary: sec,
           subRows: [],
-          generalEducation: info.generalEducation ?? [],
+          generalEducation: info.generalEducation ?? ["Stryker was here"],
         });
       }
killedBy: convertedSectionsToPrimaryRows uses empty description and generalEducation when null on courseInfo
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:90:9
       }
     }
 
-    if (currentPrimary) {
+    if (true) {
       result.push(currentPrimary);
     }
killedBy: convertedSectionsToPrimaryRows discussion before any lecture becomes its own primary row
statusReason: expected [ { quarter: '20221', …(6) }, null ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/main/utils/convertedSectionsToPrimaryRows.jsx:90:9
       }
     }
 
-    if (currentPrimary) {
+    if (false) {
       result.push(currentPrimary);
     }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
