[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:50:15
         ),
     },
     {
-      header: "Days",
+      header: "",
       accessorKey: "days",
       cell: ({ row }) => formatDays(row.original.section.timeLocations),
killedBy: ConvertedSectionTable tests renders with expected headers
statusReason: Unable to find an element with the text: Days. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ConvertedSectionTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:51:20
     },
     {
       header: "Days",
-      accessorKey: "days",
+      accessorKey: "",
       cell: ({ row }) => formatDays(row.original.section.timeLocations),
     },
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:59:5
       accessorKey: "time",
       cell: ({ row }) => formatTime(row.original.section.timeLocations),
     },
-    {
-      header: "Location",
-      accessorKey: "location",
-      cell: ({ row }) => formatLocation(row.original.section.timeLocations),
-    },
+    {},
     {
       header: "Instructors",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:76:20
     },
     {
       header: "Summer session",
-      accessorKey: "summerSession",
+      accessorKey: "",
       cell: ({ row }) => formatSummerSession(row.original.section.session),
     },
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:77:13
     {
       header: "Summer session",
       accessorKey: "summerSession",
-      cell: ({ row }) => formatSummerSession(row.original.section.session),
+      cell: () => undefined,
     },
   ];
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:
