[Killed] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:11:72
 const AdminUsersPage = () => {
   const [selectedPage, setSelectedPage] = useState(1);
   const [pageSize] = useLocalStorage("UsersSearch.PageSize", "10");
-  const [sortDirection] = useLocalStorage("UsersSearch.SortDirection", "ASC");
+  const [sortDirection] = useLocalStorage("UsersSearch.SortDirection", "");
 
   const {
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: expected { page: +0, pageSize: '10', …(1) } to deeply equal { page: +0, pageSize: '10', …(1) }

[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:20:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users", selectedPage, pageSize, sortDirection],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/admin/users",
-      params: {
-        page: selectedPage - 1,
-        pageSize: pageSize,
-        sortDirection: sortDirection,
-      },
-    },
+    {},
     { content: [], totalPages: 0 },
   );
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
