[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:15:49
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
+      if (index + 1 < timeLocationArray.length) {}
     }
     return res;
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected 'LOC1 1LOC2 2' to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:87:49
 };
 
 // Summer session letter from GOLD-style session code (e.g. "00000A  " -> "A").
-export const formatSummerSession = (session) => {
-  if (session == null || typeof session !== "string") {
-    return "";
-  }
-  const s = session.trim();
-  if (s.length < 6) {
-    return "";
-  }
-  const ch = s.charAt(5);
-  return /^[A-Za-z]$/.test(ch) ? ch.toUpperCase() : "";
-};
+export const formatSummerSession = (session) => {};
 
 // returns the course status based on cancel, closed, or full
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:88:7
 
 // Summer session letter from GOLD-style session code (e.g. "00000A  " -> "A").
 export const formatSummerSession = (session) => {
-  if (session == null || typeof session !== "string") {
+  if (session != null || typeof session !== "string") {
     return "";
   }
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:88:26
 
 // Summer session letter from GOLD-style session code (e.g. "00000A  " -> "A").
 export const formatSummerSession = (session) => {
-  if (session == null || typeof session !== "string") {
+  if (session == null || typeof session === "string") {
     return "";
   }
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Timeout] MethodExpression
src/main/utils/sectionUtils.jsx:91:13
   if (session == null || typeof session !== "string") {
     return "";
   }
-  const s = session.trim();
+  const s = session;
   if (s.length < 6) {
     return "";

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:92:7
     return "";
   }
   const s = session.trim();
-  if (s.length < 6) {
+  if (s.length >= 6) {
     return "";
   }
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:92:7
     return "";
   }
   const s = session.trim();
-  if (s.length < 6) {
+  if (true) {
     return "";
   }
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Killed] MethodExpression
src/main/utils/sectionUtils.jsx:95:14
   if (s.length < 6) {
     return "";
   }
-  const ch = s.charAt(5);
+  const ch = s;
   return /^[A-Za-z]$/.test(ch) ? ch.toUpperCase() : "";
 };
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:

[Killed] MethodExpression
src/main/utils/sectionUtils.jsx:96:34
     return "";
   }
   const ch = s.charAt(5);
-  return /^[A-Za-z]$/.test(ch) ? ch.toUpperCase() : "";
+  return /^[A-Za-z]$/.test(ch) ? ch.toLowerCase() : "";
 };
 
killedBy: ConvertedSectionTable tests Summer session cell shows letter when session code has one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  C
Received:
  c

[Timeout] Regex
src/main/utils/sectionUtils.jsx:96:10
     return "";
   }
   const ch = s.charAt(5);
-  return /^[A-Za-z]$/.test(ch) ? ch.toUpperCase() : "";
+  return /[A-Za-z]$/.test(ch) ? ch.toUpperCase() : "";
 };
 

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:105:58
     return "Cancelled";
   } else if (section.classClosed === "Y") {
     return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
-    return "Full";
-  } else {
+  } else if (section.enrolledTotal >= section.maxEnroll) {} else {
     return "Open";
   }
killedBy: section utils tests formatStatus tests formatStatus full test
statusReason: expected undefined to be 'Full' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:123:15
     <a
       href={formatInfoLink(row)}
       data-testid={`${testid}-row-${row.id}-col-info-link`}
-      target={"_blank"}
+      target={""}
       rel="noopener noreferrer"
       style={{ color: "black", backgroundColor: "inherit" }}
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: expected '' to be '_blank' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:161:10
   !isPrimary(row) || row.original.subRows.length === 0;
 
 export function getSection(row) {
-  return "primary" in row.original ? row.original.primary : row.original;
+  return "" in row.original ? row.original.primary : row.original;
 }
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
