[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:22:20
 
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
-  const startQtr = systemInfo?.startQtrYYYYQ || "20221";
+  const startQtr = systemInfo?.startQtrYYYYQ && "20221";
   const endQtr = systemInfo?.endQtrYYYYQ || "20222";
   const quarters = quarterRange(startQtr, endQtr);
killedBy: CSVDownloadsPage tests does not crash when systemInfo is null (optional chaining)
statusReason: param should be a string

[Killed] OptionalChaining
main/pages/CSV/CSVDownloadsPage.jsx:22:20
 
 export default function CSVDownloadsPage() {
   const { data: systemInfo } = useSystemInfo();
-  const startQtr = systemInfo?.startQtrYYYYQ || "20221";
+  const startQtr = systemInfo.startQtrYYYYQ || "20221";
   const endQtr = systemInfo?.endQtrYYYYQ || "20222";
   const quarters = quarterRange(startQtr, endQtr);
killedBy: CSVDownloadsPage tests does not crash when systemInfo is null (optional chaining)
statusReason: Cannot read properties of null (reading 'startQtrYYYYQ')

[Killed] ObjectLiteral
main/pages/CSV/CSVDownloadsPage.jsx:32:5
     status: _status,
   } = useBackend(
     ["/api/UCSBSubjects/all"],
-    { method: "GET", url: "/api/UCSBSubjects/all" },
+    {},
     [],
   );
killedBy: CSVDownloadsPage tests calls useBackend with the correct request and cache key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/UCSBSubjects/all' ], …(2) ]

Received:

  1st useBackend call:

  [
    [

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:37:49
   );
 
   const localQuarter = localStorage.getItem("CSVDownloads.Quarter");
-  const localSubjectArea = localStorage.getItem("CSVDownloads.SubjectArea");
+  const localSubjectArea = localStorage.getItem("");
   const localLevel = localStorage.getItem("CSVDownloads.Level");
   const localOmitSections =
killedBy: CSVDownloadsPage tests reads expected localStorage keys on initial render
statusReason: expected "getItem" to be called with arguments: [ 'CSVDownloads.SubjectArea' ]

Received:

  1st getItem call:

  [
-   "CSVDownloads.SubjectArea",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:38:43
 
   const localQuarter = localStorage.getItem("CSVDownloads.Quarter");
   const localSubjectArea = localStorage.getItem("CSVDownloads.SubjectArea");
-  const localLevel = localStorage.getItem("CSVDownloads.Level");
+  const localLevel = localStorage.getItem("");
   const localOmitSections =
     localStorage.getItem("CSVDownloads.OmitSections") === "false"
killedBy: CSVDownloadsPage tests by-quarter-and-subject uses localStorage level when unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=G&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:40:5
   const localSubjectArea = localStorage.getItem("CSVDownloads.SubjectArea");
   const localLevel = localStorage.getItem("CSVDownloads.Level");
   const localOmitSections =
-    localStorage.getItem("CSVDownloads.OmitSections") === "false"
+    false
       ? false
       : true;
killedBy: CSVDownloadsPage tests checkbox defaults honor localStorage 'false' branches
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.OmitSections-checkbox"
  id="CSVDownloads.OmitSections"

[Killed] EqualityOperator
main/pages/CSV/CSVDownloadsPage.jsx:40:5
   const localSubjectArea = localStorage.getItem("CSVDownloads.SubjectArea");
   const localLevel = localStorage.getItem("CSVDownloads.Level");
   const localOmitSections =
-    localStorage.getItem("CSVDownloads.OmitSections") === "false"
+    localStorage.getItem("CSVDownloads.OmitSections") !== "false"
       ? false
       : true;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:41:9
   const localLevel = localStorage.getItem("CSVDownloads.Level");
   const localOmitSections =
     localStorage.getItem("CSVDownloads.OmitSections") === "false"
-      ? false
+      ? true
       : true;
   const localWithTimeLocations =
killedBy: CSVDownloadsPage tests checkbox defaults honor localStorage 'false' branches
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.OmitSections-checkbox"
  id="CSVDownloads.OmitSections"

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:42:9
   const localOmitSections =
     localStorage.getItem("CSVDownloads.OmitSections") === "false"
       ? false
-      : true;
+      : false;
   const localWithTimeLocations =
     localStorage.getItem("CSVDownloads.WithTimeLocations") === "false"
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:44:5
       ? false
       : true;
   const localWithTimeLocations =
-    localStorage.getItem("CSVDownloads.WithTimeLocations") === "false"
+    true
       ? false
       : true;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] EqualityOperator
main/pages/CSV/CSVDownloadsPage.jsx:44:5
       ? false
       : true;
   const localWithTimeLocations =
-    localStorage.getItem("CSVDownloads.WithTimeLocations") === "false"
+    localStorage.getItem("CSVDownloads.WithTimeLocations") !== "false"
       ? false
       : true;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:45:9
       : true;
   const localWithTimeLocations =
     localStorage.getItem("CSVDownloads.WithTimeLocations") === "false"
-      ? false
+      ? true
       : true;
 
killedBy: CSVDownloadsPage tests checkbox defaults honor localStorage 'false' branches
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CSVDownloads.WithTimeLocations-checkbox"
  id="CSVDownloads.WithTimeLocations"

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:49:5
       : true;
 
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[quarters.length - 1].yyyyq,
+    false,
   );
   const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
killedBy: CSVDownloadsPage tests by-quarter uses default quarter when unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/quarter?yyyyq=20242",

[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:49:5
       : true;
 
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[quarters.length - 1].yyyyq,
+    localQuarter && quarters[quarters.length - 1].yyyyq,
   );
   const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
killedBy: CSVDownloadsPage tests by-quarter uses default quarter when unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/quarter?yyyyq=20242",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:51:50
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[quarters.length - 1].yyyyq,
   );
-  const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
+  const [subjectArea, setSubjectArea] = useState(true);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(localOmitSections);
killedBy: CSVDownloadsPage tests localStorage subject area is used in the download URL
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=MATH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:51:50
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[quarters.length - 1].yyyyq,
   );
-  const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
+  const [subjectArea, setSubjectArea] = useState(false);
   const [level, setLevel] = useState(localLevel || "U");
   const [omitSections, setOmitSections] = useState(localOmitSections);
killedBy: CSVDownloadsPage tests localStorage subject area is used in the download URL
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=MATH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:52:38
     localQuarter || quarters[quarters.length - 1].yyyyq,
   );
   const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
-  const [level, setLevel] = useState(localLevel || "U");
+  const [level, setLevel] = useState(true);
   const [omitSections, setOmitSections] = useState(localOmitSections);
   const [withTimeLocations, setWithTimeLocations] = useState(
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:52:38
     localQuarter || quarters[quarters.length - 1].yyyyq,
   );
   const [subjectArea, setSubjectArea] = useState(localSubjectArea || "");
-  const [level, setLevel] = useState(localLevel || "U");
+  const [level, setLevel] = useState(localLevel && "U");
   const [omitSections, setOmitSections] = useState(localOmitSections);
   const [withTimeLocations, setWithTimeLocations] = useState(
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:58:19
     localWithTimeLocations,
   );
 
-  useEffect(() => {
-    if (subjects.length > 0 && !subjectArea) {
-      setSubjectArea(subjects[0].subjectCode);
-    }
-  }, [subjects, subjectArea]);
+  useEffect(() => {}, [subjects, subjectArea]);
 
   const byQuarterUrl = `/api/courses/csv/quarter?yyyyq=${encodeURIComponent(quarter)}`;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Unable to find a label with the text of: Subject Area

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:59:32
   );
 
   useEffect(() => {
-    if (subjects.length > 0 && !subjectArea) {
+    if (subjects.length > 0 && subjectArea) {
       setSubjectArea(subjects[0].subjectCode);
     }
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Unable to find a label with the text of: Subject Area

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/CSV/CSVDownloadsPage.jsx:59:9
   );
 
   useEffect(() => {
-    if (subjects.length > 0 && !subjectArea) {
+    if (subjects.length <= 0 && !subjectArea) {
       setSubjectArea(subjects[0].subjectCode);
     }
killedBy: CSVDownloadsPage tests renders correctly
statusReason: Cannot read properties of undefined (reading 'subjectCode')

[Killed] ArrayDeclaration
main/pages/CSV/CSVDownloadsPage.jsx:62:6
     if (subjects.length > 0 && !subjectArea) {
       setSubjectArea(subjects[0].subjectCode);
     }
-  }, [subjects, subjectArea]);
+  }, []);
 
   const byQuarterUrl = `/api/courses/csv/quarter?yyyyq=${encodeURIComponent(quarter)}`;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Unable to find a label with the text of: Subject Area

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:68:5
   const byQuarterAndSubjectUrl =
     `/api/courses/csv/byQuarterAndSubjectArea?yyyyq=${encodeURIComponent(quarter)}` +
     `&subjectArea=${encodeURIComponent(subjectArea)}` +
-    `&level=${encodeURIComponent(level)}` +
+    `` +
     `&omitSections=${encodeURIComponent(omitSections ? "true" : "false")}` +
     `&withTimeLocations=${encodeURIComponent(withTimeLocations ? "true" : "false")}`;
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:70:75
     `&subjectArea=${encodeURIComponent(subjectArea)}` +
     `&level=${encodeURIComponent(level)}` +
     `&omitSections=${encodeURIComponent(omitSections ? "true" : "false")}` +
-    `&withTimeLocations=${encodeURIComponent(withTimeLocations ? "true" : "false")}`;
+    `&withTimeLocations=${encodeURIComponent(withTimeLocations ? "true" : "")}`;
 
   const downloadCsv = (url) => {
killedBy: CSVDownloadsPage tests by-quarter-and-subject: level and checkboxes affect URL and write localStorage
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=G&omitSections=false&withTimeLocations=false",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:70:66
     `&subjectArea=${encodeURIComponent(subjectArea)}` +
     `&level=${encodeURIComponent(level)}` +
     `&omitSections=${encodeURIComponent(omitSections ? "true" : "false")}` +
-    `&withTimeLocations=${encodeURIComponent(withTimeLocations ? "true" : "false")}`;
+    `&withTimeLocations=${encodeURIComponent(withTimeLocations ? "" : "false")}`;
 
   const downloadCsv = (url) => {
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=U&omitSections=true&withTimeLocations=true",

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:81:45
     downloadCsv(byQuarterUrl);
   };
 
-  const handleQuarterSubjectSubmit = (e) => {
-    e.preventDefault();
-    if (subjectArea) downloadCsv(byQuarterAndSubjectUrl);
-  };
+  const handleQuarterSubjectSubmit = (e) => {};
 
   return (
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:83:9
 
   const handleQuarterSubjectSubmit = (e) => {
     e.preventDefault();
-    if (subjectArea) downloadCsv(byQuarterAndSubjectUrl);
+    if (true) downloadCsv(byQuarterAndSubjectUrl);
   };
 
killedBy: CSVDownloadsPage tests by-quarter-and-subject: does not download if subjectArea is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20222&subjectArea=&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:83:9
 
   const handleQuarterSubjectSubmit = (e) => {
     e.preventDefault();
-    if (subjectArea) downloadCsv(byQuarterAndSubjectUrl);
+    if (false) downloadCsv(byQuarterAndSubjectUrl);
   };
 
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:106:36
                         quarters={quarters}
                         quarter={quarter}
                         setQuarter={setQuarter}
-                        controlId={"CSVDownloads.Quarter"}
+                        controlId={""}
                         label={"Quarter"}
                       />
killedBy: CSVDownloadsPage tests downloads by-quarter CSV
statusReason: Unable to find an element by: [data-testid="CSVDownloads.Quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:116:35
                       <Button
                         type="submit"
                         variant="primary"
-                        disabled={!quarter}
+                        disabled={quarter}
                       >
                         Download CSV
killedBy: CSVDownloadsPage tests by-quarter Download CSV button is enabled when quarter is present
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-primary"
  disabled=""
  type="submit"
/>

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:141:36
                         quarters={quarters}
                         quarter={quarter}
                         setQuarter={setQuarter}
-                        controlId={"CSVDownloads.QuarterBySubjectArea"}
+                        controlId={""}
                         label={"Quarter"}
                         onChange={(e) => {
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Unable to find an element by: [data-testid="CSVDownloads.QuarterBySubjectArea"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:143:42
                         setQuarter={setQuarter}
                         controlId={"CSVDownloads.QuarterBySubjectArea"}
                         label={"Quarter"}
-                        onChange={(e) => {
-                          localStorage.setItem(
-                            "CSVDownloads.Quarter",
-                            e.target.value,
-                          );
-                          localStorage.setItem(
-                            "CSVDownloads.QuarterBySubjectArea",
-                            e.target.value,
-                          );
-                        }}
+                        onChange={(e) => {}}
                       />
                     </Col>
killedBy: CSVDownloadsPage tests by-quarter-and-subject: quarter dropdown writes both keys and controls disabled state
statusReason: expected "setItem" to be called with arguments: [ 'CSVDownloads.Quarter', '20242' ]

Received:

  1st setItem call:

  [
    "CSVDownloads.Quarter",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:145:29
                         label={"Quarter"}
                         onChange={(e) => {
                           localStorage.setItem(
-                            "CSVDownloads.Quarter",
+                            "",
                             e.target.value,
                           );
killedBy: CSVDownloadsPage tests by-quarter-and-subject: quarter dropdown writes both keys and controls disabled state
statusReason: expected "setItem" to not be called with arguments: [ '', '20242' ]

Received:

  1st setItem call:

  [
-   "",

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:149:29
                             e.target.value,
                           );
                           localStorage.setItem(
-                            "CSVDownloads.QuarterBySubjectArea",
+                            "",
                             e.target.value,
                           );
killedBy: CSVDownloadsPage tests by-quarter-and-subject: quarter dropdown writes both keys and controls disabled state
statusReason: expected "setItem" to not be called with arguments: [ '', '20242' ]

Received:

  1st setItem call:

  [
-   "",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:156:24
                       />
                     </Col>
                     <Col md="auto">
-                      {subjects.length > 0 && subjectArea && (
-                        <SingleSubjectDropdown
-                          subjects={subjects}
-                          subject={subjectArea}
-                          setSubject={setSubjectArea}
-                          controlId={"CSVDownloads.SubjectArea"}
-                          label={"Subject Area"}
-                        />
-                      )}
+                      {false}
                     </Col>
                     <Col md="auto">
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Unable to find a label with the text of: Subject Area

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:156:24
                       />
                     </Col>
                     <Col md="auto">
-                      {subjects.length > 0 && subjectArea && (
+                      {subjects.length > 0 || subjectArea && (
                         <SingleSubjectDropdown
                           subjects={subjects}
killedBy: CSVDownloadsPage tests does not render Subject Area dropdown when subjects is empty even if subjectArea is set
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <select
  class="form-control"
  id="CSVDownloads.SubjectArea"
/> instead

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:161:38
                           subjects={subjects}
                           subject={subjectArea}
                           setSubject={setSubjectArea}
-                          controlId={"CSVDownloads.SubjectArea"}
+                          controlId={""}
                           label={"Subject Area"}
                         />
killedBy: CSVDownloadsPage tests by-quarter-and-subject default URL uses level=U when not changed
statusReason: Found a label with the text of: Subject Area, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/CSV/CSVDownloadsPage.jsx:171:32
                         levels={allTheLevels}
                         setLevel={setLevel}
                         controlId={"CSVDownloads.Level"}
-                        label={"Level"}
+                        label={""}
                       />
                     </Col>
killedBy: CSVDownloadsPage tests initializes level from localStorage (kills level init mutants)
statusReason: Unable to find a label with the text of: Level

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:181:44
                         <FormCheck
                           data-testid="CSVDownloads.OmitSections-checkbox"
                           label="Omit sections"
-                          onChange={(e) => {
-                            setOmitSections(e.target.checked);
-                            localStorage.setItem(
-                              "CSVDownloads.OmitSections",
-                              e.target.checked.toString(),
-                            );
-                          }}
+                          onChange={(e) => {}}
                           checked={omitSections}
                         />
killedBy: CSVDownloadsPage tests by-quarter-and-subject: level and checkboxes affect URL and write localStorage
statusReason: expected "setItem" to be called with arguments: [ Array(2) ]

Received:

  1st setItem call:

  [
-   "CSVDownloads.OmitSections",

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:197:44
                         <FormCheck
                           data-testid="CSVDownloads.WithTimeLocations-checkbox"
                           label="With time/locations"
-                          onChange={(e) => {
-                            setWithTimeLocations(e.target.checked);
-                            localStorage.setItem(
-                              "CSVDownloads.WithTimeLocations",
-                              e.target.checked.toString(),
-                            );
-                          }}
+                          onChange={(e) => {}}
                           checked={withTimeLocations}
                         />
killedBy: CSVDownloadsPage tests by-quarter-and-subject: level and checkboxes affect URL and write localStorage
statusReason: expected "setItem" to be called with arguments: [ …(2) ]

Received:

  1st setItem call:

  [
-   "CSVDownloads.WithTimeLocations",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:214:35
                       <Button
                         type="submit"
                         variant="primary"
-                        disabled={!quarter || !subjectArea}
+                        disabled={false}
                       >
                         Download CSV
killedBy: CSVDownloadsPage tests by-quarter-and-subject: quarter dropdown writes both keys and controls disabled state
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  type="submit"
/>

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:214:35
                       <Button
                         type="submit"
                         variant="primary"
-                        disabled={!quarter || !subjectArea}
+                        disabled={quarter || !subjectArea}
                       >
                         Download CSV
killedBy: CSVDownloadsPage tests by-quarter-and-subject: quarter dropdown writes both keys and controls disabled state
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  type="submit"
/>
