[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:40:36
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
-  const [area, setArea] = useState(localArea || "ALL");
+  const [area, setArea] = useState(localArea && "ALL");
 
   const handleSubmit = (event) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:40:36
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
-  const [area, setArea] = useState(localArea || "ALL");
+  const [area, setArea] = useState(true);
 
   const handleSubmit = (event) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:70:42
                 <option data-testid="GEAreaSearch.Area-option-all" value="ALL">
                   ALL
                 </option>
-                {areaCodes.map((code) => {
-                  const testid = `GEAreaSearch.Area-option-${code}`;
-                  return (
-                    <option key={code} data-testid={testid} value={code}>
-                      {code}
-                    </option>
-                  );
-                })}
+                {areaCodes.map((code) => {})}
               </Form.Control>
             </Form.Group>
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend selecting GE area updates state
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
