[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:14:20
   const { data: systemInfo } = useSystemInfo();
 
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20221";
+  const startQtr = false;
   const endQtr = systemInfo?.endQtrYYYYQ || "20222";
   // Stryker enable OptionalChaining
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: param should be a string

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:14:20
   const { data: systemInfo } = useSystemInfo();
 
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20221";
+  const startQtr = true;
   const endQtr = systemInfo?.endQtrYYYYQ || "20222";
   // Stryker enable OptionalChaining
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: param should be a string

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:15:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20221";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20222";
+  const endQtr = true;
   // Stryker enable OptionalChaining
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: param should be a string

[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:15:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20221";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20222";
+  const endQtr = systemInfo?.endQtrYYYYQ && "20222";
   // Stryker enable OptionalChaining
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly when useSystemInfo doesn't resolve in time
statusReason: param should be a string

[Killed] ArrowFunction
main/components/GEAreas/GEAreaSearchForm.jsx:36:31
     [],
   );
 
-  const areaCodes = areas.map((r) => r.requirementCode);
+  const areaCodes = areas.map(() => undefined);
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend selecting GE area updates state
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:38:5
 
   const areaCodes = areas.map((r) => r.requirementCode);
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[0]?.yyyyq || startQtr,
+    localQuarter && quarters[0]?.yyyyq || startQtr,
   );
   const [area, setArea] = useState(localArea || "");
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: expected '20211' to be '20213' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:38:5
 
   const areaCodes = areas.map((r) => r.requirementCode);
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[0]?.yyyyq || startQtr,
+    true,
   );
   const [area, setArea] = useState(localArea || "");
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: yyyyq.charAt is not a function

[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:40:36
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
-  const [area, setArea] = useState(localArea || "");
+  const [area, setArea] = useState(localArea && "");
 
   // Once GE areas load from the API, default to the first one if nothing is selected
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:40:36
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
-  const [area, setArea] = useState(localArea || "");
+  const [area, setArea] = useState(true);
 
   // Once GE areas load from the API, default to the first one if nothing is selected
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:43:19
   const [area, setArea] = useState(localArea || "");
 
   // Once GE areas load from the API, default to the first one if nothing is selected
-  useEffect(() => {
-    if (!area && areaCodes.length > 0) {
-      setArea(areaCodes[0]);
-    }
-  }, [areaCodes.length]); // eslint-disable-line react-hooks/exhaustive-deps
+  useEffect(() => {}, [areaCodes.length]); // eslint-disable-line react-hooks/exhaustive-deps
 
   const handleSubmit = (event) => {

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:44:9
 
   // Once GE areas load from the API, default to the first one if nothing is selected
   useEffect(() => {
-    if (!area && areaCodes.length > 0) {
+    if (true) {
       setArea(areaCodes[0]);
     }
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] EqualityOperator
main/components/GEAreas/GEAreaSearchForm.jsx:44:18
 
   // Once GE areas load from the API, default to the first one if nothing is selected
   useEffect(() => {
-    if (!area && areaCodes.length > 0) {
+    if (!area && areaCodes.length <= 0) {
       setArea(areaCodes[0]);
     }

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:49:35
     }
   }, [areaCodes.length]); // eslint-disable-line react-hooks/exhaustive-deps
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    localStorage.setItem(quarterKey, quarter);
-    localStorage.setItem(areaKey, area);
-    fetchJSON(event, { quarter, area });
-  };
+  const handleSubmit = (event) => {};
 
   return (
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ArrowFunction
main/components/GEAreas/GEAreaSearchForm.jsx:72:27
               <Form.Control
                 as="select"
                 value={area}
-                onChange={(e) => setArea(e.target.value)}
+                onChange={() => undefined}
               >
                 {areaCodes.map((code) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:74:42
                 value={area}
                 onChange={(e) => setArea(e.target.value)}
               >
-                {areaCodes.map((code) => {
-                  const testid = `GEAreaSearch.Area-option-${code}`;
-                  return (
-                    <option key={code} data-testid={testid} value={code}>
-                      {code}
-                    </option>
-                  );
-                })}
+                {areaCodes.map((code) => {})}
               </Form.Control>
             </Form.Group>
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend selecting GE area updates state
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
