[Killed] ArrayDeclaration
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:8:42
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function GeneralEducationSearchPage() {
-  const [courses, setCourses] = useState([]);
+  const [courses, setCourses] = useState(["Stryker was here"]);
 
   const objectToAxiosParams = (query) => ({
killedBy: GeneralEducationSearchPage tests renders without crashing and shows the heading
statusReason: Cannot read properties of undefined (reading 'charAt')

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:18:31
     },
   });
 
-  const onSuccess = (data) => {
-    setCourses(data);
-  };
+  const onSuccess = (data) => {};
 
   const mutation = useBackendMutation(
killedBy: GeneralEducationSearchPage tests displays course results in table after search
statusReason: Unable to find an element by: [data-testid="CoursesInGEAreaTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:29:48
     [],
   );
 
-  async function fetchGECourses(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchGECourses(_event, query) {}
 
   return (
killedBy: GeneralEducationSearchPage tests calls primariesge API with correct params when form is submitted
statusReason: expected undefined to be defined
