[Killed] ArrowFunction
main/components/GEAreas/CoursesInGEAreaTable.jsx:10:13
     {
       Header: "Quarter",
       id: "quarter",
-      cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
+      cell: () => undefined,
     },
     {
killedBy: CoursesInGEAreaTable tests renders course data with correct content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  F24
Received:

[Killed] ObjectLiteral
main/components/GEAreas/CoursesInGEAreaTable.jsx:12:5
       id: "quarter",
       cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
     },
-    {
-      Header: "Course ID",
-      id: "courseId",
-      cell: ({ cell }) => cell.row.original.courseId?.trim(),
-    },
+    {},
     {
       Header: "Title",
killedBy: GeneralEducationSearchPage tests renders without crashing and shows the heading
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/GEAreas/CoursesInGEAreaTable.jsx:15:13
     {
       Header: "Course ID",
       id: "courseId",
-      cell: ({ cell }) => cell.row.original.courseId?.trim(),
+      cell: () => undefined,
     },
     {
killedBy: GeneralEducationSearchPage tests displays course results in table after search
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  MATH 2A
Received:

[Survived] MethodExpression
main/components/GEAreas/CoursesInGEAreaTable.jsx:15:27
     {
       Header: "Course ID",
       id: "courseId",
-      cell: ({ cell }) => cell.row.original.courseId?.trim(),
+      cell: ({ cell }) => cell.row.original.courseId,
     },
     {

[Killed] ObjectLiteral
main/components/GEAreas/CoursesInGEAreaTable.jsx:21:5
       Header: "Title",
       accessor: "title",
     },
-    {
-      Header: "Units",
-      accessor: "unitsFixed",
-    },
+    {},
     {
       Header: "GE Areas",
killedBy: GeneralEducationSearchPage tests renders without crashing and shows the heading
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/GEAreas/CoursesInGEAreaTable.jsx:22:15
       accessor: "title",
     },
     {
-      Header: "Units",
+      Header: "",
       accessor: "unitsFixed",
     },
killedBy: CoursesInGEAreaTable tests renders empty table with correct headers
statusReason: Unable to find an element with the text: Units. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesInGEAreaTable"

[Killed] StringLiteral
main/components/GEAreas/CoursesInGEAreaTable.jsx:27:11
     },
     {
       Header: "GE Areas",
-      id: "geAreas",
+      id: "",
       cell: ({ cell }) =>
         (cell.row.original.generalEducation || [])
killedBy: GeneralEducationSearchPage tests renders without crashing and shows the heading
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/GEAreas/CoursesInGEAreaTable.jsx:28:13
     {
       Header: "GE Areas",
       id: "geAreas",
-      cell: ({ cell }) =>
-        (cell.row.original.generalEducation || [])
-          .map((ge) => {
-            const code = ge.geCode?.trim();
-            const college = ge.geCollege?.trim();
-            return college ? `${code} (${college})` : code;
-          })
-          .join(", "),
+      cell: () => undefined,
     },
   ];
killedBy: GeneralEducationSearchPage tests displays GE areas as comma-joined codes for courses with multiple GEs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  QNT (L&S), C (L&S)
Received:

[Killed] ConditionalExpression
main/components/GEAreas/CoursesInGEAreaTable.jsx:29:10
       Header: "GE Areas",
       id: "geAreas",
       cell: ({ cell }) =>
-        (cell.row.original.generalEducation || [])
+        (true)
           .map((ge) => {
             const code = ge.geCode?.trim();
killedBy: GeneralEducationSearchPage tests displays course results in table after search
statusReason: Unable to find an element by: [data-testid="CoursesInGEAreaTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/components/GEAreas/CoursesInGEAreaTable.jsx:29:10
       Header: "GE Areas",
       id: "geAreas",
       cell: ({ cell }) =>
-        (cell.row.original.generalEducation || [])
+        (cell.row.original.generalEducation && [])
           .map((ge) => {
             const code = ge.geCode?.trim();
killedBy: GeneralEducationSearchPage tests displays GE areas as comma-joined codes for courses with multiple GEs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  QNT (L&S), C (L&S)
Received:

[Killed] BlockStatement
main/components/GEAreas/CoursesInGEAreaTable.jsx:30:24
       id: "geAreas",
       cell: ({ cell }) =>
         (cell.row.original.generalEducation || [])
-          .map((ge) => {
-            const code = ge.geCode?.trim();
-            const college = ge.geCollege?.trim();
-            return college ? `${code} (${college})` : code;
-          })
+          .map((ge) => {})
           .join(", "),
     },
killedBy: GeneralEducationSearchPage tests displays GE areas as comma-joined codes for courses with multiple GEs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  QNT (L&S), C (L&S)
Received:
  ,

[Survived] OptionalChaining
main/components/GEAreas/CoursesInGEAreaTable.jsx:31:26
       cell: ({ cell }) =>
         (cell.row.original.generalEducation || [])
           .map((ge) => {
-            const code = ge.geCode?.trim();
+            const code = ge.geCode.trim();
             const college = ge.geCollege?.trim();
             return college ? `${code} (${college})` : code;

[Survived] MethodExpression
main/components/GEAreas/CoursesInGEAreaTable.jsx:31:26
       cell: ({ cell }) =>
         (cell.row.original.generalEducation || [])
           .map((ge) => {
-            const code = ge.geCode?.trim();
+            const code = ge.geCode;
             const college = ge.geCollege?.trim();
             return college ? `${code} (${college})` : code;

[Killed] MethodExpression
main/components/GEAreas/CoursesInGEAreaTable.jsx:32:29
         (cell.row.original.generalEducation || [])
           .map((ge) => {
             const code = ge.geCode?.trim();
-            const college = ge.geCollege?.trim();
+            const college = ge.geCollege;
             return college ? `${code} (${college})` : code;
           })
killedBy: GeneralEducationSearchPage tests displays GE areas as comma-joined codes for courses with multiple GEs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  QNT (L&S), C (L&S)
Received:
  QNT (L&S ), C (L&S )

[Survived] OptionalChaining
main/components/GEAreas/CoursesInGEAreaTable.jsx:32:29
         (cell.row.original.generalEducation || [])
           .map((ge) => {
             const code = ge.geCode?.trim();
-            const college = ge.geCollege?.trim();
+            const college = ge.geCollege.trim();
             return college ? `${code} (${college})` : code;
           })
