[Killed] LogicalOperator
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:49:12
             // Stryker disable next-line all
             dot={false}
           />
-          {passTimes &&
-            passTimes.map((pass) => (
-              <ReferenceLine
-                key={pass.label}
-                // Stryker disable next-line all
-                x={new Date(pass.date).getTime()}
-                stroke="#ff7300"
-                // Stryker disable next-line all
-                label={{ value: pass.label, position: "insideTopRight" }}
-              />
-            ))}
+          {passTimes || passTimes.map(pass => <ReferenceLine key={pass.label}
+// Stryker disable next-line all
+x={new Date(pass.date).getTime()} stroke="#ff7300"
+// Stryker disable next-line all
+label={{
+  value: pass.label,
+  position: "insideTopRight"
+}} />)}
         </LineChart>
       </ResponsiveContainer>
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:49:12
             // Stryker disable next-line all
             dot={false}
           />
-          {passTimes &&
-            passTimes.map((pass) => (
-              <ReferenceLine
-                key={pass.label}
-                // Stryker disable next-line all
-                x={new Date(pass.date).getTime()}
-                stroke="#ff7300"
-                // Stryker disable next-line all
-                label={{ value: pass.label, position: "insideTopRight" }}
-              />
-            ))}
+          {true}
         </LineChart>
       </ResponsiveContainer>
killedBy: EnrollmentHistoryGraph renders reference lines when passTimes are provided
statusReason: expected +0 to be 3 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:50:27
             dot={false}
           />
           {passTimes &&
-            passTimes.map((pass) => (
-              <ReferenceLine
-                key={pass.label}
-                // Stryker disable next-line all
-                x={new Date(pass.date).getTime()}
-                stroke="#ff7300"
-                // Stryker disable next-line all
-                label={{ value: pass.label, position: "insideTopRight" }}
-              />
-            ))}
+            passTimes.map(() => undefined)}
         </LineChart>
       </ResponsiveContainer>
killedBy: EnrollmentHistoryGraph renders reference lines when passTimes are provided
statusReason: expected +0 to be 3 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:66:70
   );
 };
 
-const EnrollmentHistoryGraph = ({ enrollmentHistory, passTimes }) => {
-  if (!enrollmentHistory || enrollmentHistory.length === 0) {
-    return <div data-testid="enrollment-history-graph-empty" />;
-  }
-
-  const groups = groupBySectionAndQuarter(enrollmentHistory);
-
-  return (
-    <div data-testid="enrollment-history-graphs">
-      {Object.entries(groups).map(([key, sectionData]) => (
-        <EnrollmentLineChart
-          key={key}
-          data={sectionData}
-          title={`Section ${sectionData[0].section} - ${formatQuarter(sectionData[0].yyyyq)}`}
-          passTimes={passTimes}
-        />
-      ))}
-    </div>
-  );
-};
+const EnrollmentHistoryGraph = ({ enrollmentHistory, passTimes }) => {};
 
 export default EnrollmentHistoryGraph;
killedBy: EnrollmentHistoryGraph renders empty div when enrollmentHistory is empty
statusReason: Unable to find an element by: [data-testid="enrollment-history-graph-empty"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:67:29
 };
 
 const EnrollmentHistoryGraph = ({ enrollmentHistory, passTimes }) => {
-  if (!enrollmentHistory || enrollmentHistory.length === 0) {
+  if (!enrollmentHistory || enrollmentHistory.length !== 0) {
     return <div data-testid="enrollment-history-graph-empty" />;
   }
killedBy: CourseDetailsIndexPage tests Calls enrollment history api correctly and renders enrollment history graph
statusReason: Unable to find an element with the text: Section 0100 - S25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; padd

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:67:7
 };
 
 const EnrollmentHistoryGraph = ({ enrollmentHistory, passTimes }) => {
-  if (!enrollmentHistory || enrollmentHistory.length === 0) {
+  if (false) {
     return <div data-testid="enrollment-history-graph-empty" />;
   }
killedBy: EnrollmentHistoryGraph renders empty div when enrollmentHistory is empty
statusReason: Unable to find an element by: [data-testid="enrollment-history-graph-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="enrollment-history-graphs"
    />

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryGraph.jsx:75:35
 
   return (
     <div data-testid="enrollment-history-graphs">
-      {Object.entries(groups).map(([key, sectionData]) => (
-        <EnrollmentLineChart
-          key={key}
-          data={sectionData}
-          title={`Section ${sectionData[0].section} - ${formatQuarter(sectionData[0].yyyyq)}`}
-          passTimes={passTimes}
-        />
-      ))}
+      {Object.entries(groups).map(() => undefined)}
     </div>
   );
killedBy: CourseDetailsIndexPage tests Calls enrollment history api correctly and renders enrollment history graph
statusReason: Unable to find an element with the text: Section 0100 - S25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; padd
