[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:21:41
 // Stryker restore all
 
 // Converts yyyyq (e.g. "20252") to a short display label (e.g. "S25")
-export const formatQuarter = (yyyyq) => {
-  const year = yyyyq.slice(2, 4);
-  const qtr = yyyyq[4];
-  return `${quarterLabel[qtr] || "?"}${year}`;
-};
+export const formatQuarter = (yyyyq) => {};
 
 // Converts a UTC ms timestamp to a display string like "Mar 01"
killedBy: formatQuarter formats a Spring quarter correctly
statusReason: expected undefined to be 'S25' // Object.is equality

[Killed] MethodExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:22:16
 
 // Converts yyyyq (e.g. "20252") to a short display label (e.g. "S25")
 export const formatQuarter = (yyyyq) => {
-  const year = yyyyq.slice(2, 4);
+  const year = yyyyq;
   const qtr = yyyyq[4];
   return `${quarterLabel[qtr] || "?"}${year}`;
killedBy: formatQuarter formats a Spring quarter correctly
statusReason: expected 'S20252' to be 'S25' // Object.is equality

[Killed] LogicalOperator
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:24:13
 export const formatQuarter = (yyyyq) => {
   const year = yyyyq.slice(2, 4);
   const qtr = yyyyq[4];
-  return `${quarterLabel[qtr] || "?"}${year}`;
+  return `${quarterLabel[qtr] && "?"}${year}`;
 };
 
killedBy: formatQuarter formats a Spring quarter correctly
statusReason: expected '?25' to be 'S25' // Object.is equality

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:24:13
 export const formatQuarter = (yyyyq) => {
   const year = yyyyq.slice(2, 4);
   const qtr = yyyyq[4];
-  return `${quarterLabel[qtr] || "?"}${year}`;
+  return `${true}${year}`;
 };
 
killedBy: CourseDetailsIndexPage tests Calls enrollment history api correctly and renders enrollment history graph
statusReason: Unable to find an element with the text: Section 0100 - S25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; padd

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:28:49
 };
 
 // Converts a UTC ms timestamp to a display string like "Mar 01"
-export const formatDateForAxis = (timestamp) => {
-  const date = new Date(timestamp);
-  const month = MONTH_NAMES[date.getUTCMonth()];
-  const day = String(date.getUTCDate()).padStart(2, "0");
-  return `${month} ${day}`;
-};
+export const formatDateForAxis = (timestamp) => {};
 
 // Returns a new array sorted by dateCreated ascending (oldest first)
killedBy: formatDateForAxis formats a March date correctly
statusReason: expected undefined to be 'Mar 01' // Object.is equality

[Killed] StringLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:32:10
   const date = new Date(timestamp);
   const month = MONTH_NAMES[date.getUTCMonth()];
   const day = String(date.getUTCDate()).padStart(2, "0");
-  return `${month} ${day}`;
+  return ``;
 };
 
killedBy: formatDateForAxis formats a March date correctly
statusReason: expected '' to be 'Mar 01' // Object.is equality

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:36:44
 };
 
 // Returns a new array sorted by dateCreated ascending (oldest first)
-export const sortByDateCreated = (data) => {
-  return [...data].sort(
-    (a, b) =>
-      new Date(a.dateCreated).getTime() - new Date(b.dateCreated).getTime(),
-  );
-};
+export const sortByDateCreated = (data) => {};
 
 // Groups enrollment data by "yyyyq-section" key
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:37:10
 
 // Returns a new array sorted by dateCreated ascending (oldest first)
 export const sortByDateCreated = (data) => {
-  return [...data].sort(
-    (a, b) =>
-      new Date(a.dateCreated).getTime() - new Date(b.dateCreated).getTime(),
-  );
+  return [...data];
 };
 
killedBy: sortByDateCreated sorts data from oldest to newest dateCreated
statusReason: expected [ 196, 20, 152 ] to deeply equal [ 20, 152, 196 ]

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:38:5
 // Returns a new array sorted by dateCreated ascending (oldest first)
 export const sortByDateCreated = (data) => {
   return [...data].sort(
-    (a, b) =>
-      new Date(a.dateCreated).getTime() - new Date(b.dateCreated).getTime(),
+    () => undefined,
   );
 };
killedBy: sortByDateCreated sorts data from oldest to newest dateCreated
statusReason: expected [ 196, 20, 152 ] to deeply equal [ 20, 152, 196 ]

[Killed] ArithmeticOperator
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:39:7
 export const sortByDateCreated = (data) => {
   return [...data].sort(
     (a, b) =>
-      new Date(a.dateCreated).getTime() - new Date(b.dateCreated).getTime(),
+      new Date(a.dateCreated).getTime() + new Date(b.dateCreated).getTime(),
   );
 };
killedBy: sortByDateCreated sorts data from oldest to newest dateCreated
statusReason: expected [ 196, 20, 152 ] to deeply equal [ 20, 152, 196 ]

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:44:51
 };
 
 // Groups enrollment data by "yyyyq-section" key
-export const groupBySectionAndQuarter = (data) => {
-  const groups = {};
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.section}`;
-    if (!groups[key]) groups[key] = [];
-    groups[key].push(item);
-  });
-  return groups;
-};
+export const groupBySectionAndQuarter = (data) => {};
 
 // Transforms section data into a Recharts-friendly time series.
killedBy: EnrollmentHistoryGraph renders the graphs container when data is provided
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:46:26
 // Groups enrollment data by "yyyyq-section" key
 export const groupBySectionAndQuarter = (data) => {
   const groups = {};
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.section}`;
-    if (!groups[key]) groups[key] = [];
-    groups[key].push(item);
-  });
+  data.forEach((item) => {});
   return groups;
 };
killedBy: CourseDetailsIndexPage tests Calls enrollment history api correctly and renders enrollment history graph
statusReason: Unable to find an element with the text: Section 0100 - S25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; padd

[Killed] StringLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:47:17
 export const groupBySectionAndQuarter = (data) => {
   const groups = {};
   data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.section}`;
+    const key = ``;
     if (!groups[key]) groups[key] = [];
     groups[key].push(item);
killedBy: EnrollmentHistoryGraph renders two charts for two section-quarter groups
statusReason: expected [ <div …(1)><h3></h3>
…(1)</div> ] to have a length of 2 but got 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span

[Killed] BooleanLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:48:9
   const groups = {};
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.section}`;
-    if (!groups[key]) groups[key] = [];
+    if (groups[key]) groups[key] = [];
     groups[key].push(item);
   });
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:48:9
   const groups = {};
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.section}`;
-    if (!groups[key]) groups[key] = [];
+    if (true) groups[key] = [];
     groups[key].push(item);
   });
killedBy: groupBySectionAndQuarter creates a single group for one section-quarter combination
statusReason: expected [ { id: 5, yyyyq: '20252', …(5) } ] to have a length of 5 but got 1

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:56:49
 
 // Transforms section data into a Recharts-friendly time series.
 // Returns [{ timestamp: ms, enrollment: number }, ...] sorted oldest first.
-export const buildTimeSeries = (sectionData) => {
-  return sortByDateCreated(sectionData).map((item) => ({
-    timestamp: new Date(item.dateCreated).getTime(),
-    enrollment: item.enrollment,
-  }));
-};
+export const buildTimeSeries = (sectionData) => {};
 
killedBy: EnrollmentHistoryGraph renders reference lines when passTimes are provided
statusReason: expected +0 to be 3 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:57:45
 // Transforms section data into a Recharts-friendly time series.
 // Returns [{ timestamp: ms, enrollment: number }, ...] sorted oldest first.
 export const buildTimeSeries = (sectionData) => {
-  return sortByDateCreated(sectionData).map((item) => ({
-    timestamp: new Date(item.dateCreated).getTime(),
-    enrollment: item.enrollment,
-  }));
+  return sortByDateCreated(sectionData).map(() => undefined);
 };
 
killedBy: EnrollmentHistoryGraph renders reference lines when passTimes are provided
statusReason: expected +0 to be 3 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"
