[Killed] BooleanLiteral
src/main/pages/ErrorPage.jsx:8:46
 import { useBackend } from "main/utils/useBackend";
 
 const ErrorPage = () => {
-  const [showTrace, setShowTrace] = useState(false);
+  const [showTrace, setShowTrace] = useState(true);
 
   const { data: errorInfo } = useBackend(
killedBy: ErrorPage tests clicking toggle button shows and hides technical details
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Show Technical Details
Received:
  Hide Technical Details

[Killed] ArrayDeclaration
src/main/pages/ErrorPage.jsx:11:5
   const [showTrace, setShowTrace] = useState(false);
 
   const { data: errorInfo } = useBackend(
-    ["/api/currentError"],
+    [],
     { method: "GET", url: "/api/currentError" },
     null,
killedBy: ErrorPage tests calls useBackend with correct query key and axios params
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/currentError' ], …(2) ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
src/main/pages/ErrorPage.jsx:12:15
 
   const { data: errorInfo } = useBackend(
     ["/api/currentError"],
-    { method: "GET", url: "/api/currentError" },
+    { method: "", url: "/api/currentError" },
     null,
   );
killedBy: ErrorPage tests calls useBackend with correct query key and axios params
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/currentError' ], …(2) ]

Received:

  1st vi.fn() call:

  [
    [

[Killed] StringLiteral
src/main/pages/ErrorPage.jsx:12:27
 
   const { data: errorInfo } = useBackend(
     ["/api/currentError"],
-    { method: "GET", url: "/api/currentError" },
+    { method: "GET", url: "" },
     null,
   );
killedBy: ErrorPage tests calls useBackend with correct query key and axios params
statusReason: expected "vi.fn()" to be called with arguments: [ [ '/api/currentError' ], …(2) ]

Received:

  1st vi.fn() call:

@@ -2,9 +2,9 @@
    [

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:24:10
           We encountered an unexpected error. Please try again later.
         </p>
 
-        {errorInfo && (
-          <Alert variant="danger" className="text-start mt-3">
-            {errorInfo.status && (
-              <p data-testid="error-status">
-                <strong>Status:</strong> {errorInfo.status}
-              </p>
-            )}
-            {errorInfo.error && (
-              <p data-testid="error-error">
-                <strong>Error:</strong> {errorInfo.error}
-              </p>
-            )}
-            {errorInfo.message && (
-              <p data-testid="error-message">
-                <strong>Message:</strong> {errorInfo.message}
-              </p>
-            )}
-            {errorInfo.path && (
-              <p data-testid="error-path">
-                <strong>Path:</strong> {errorInfo.path}
-              </p>
-            )}
-          </Alert>
-        )}
+        {false}
 
         {errorInfo?.trace && (
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:24:10
           We encountered an unexpected error. Please try again later.
         </p>
 
-        {errorInfo && (
-          <Alert variant="danger" className="text-start mt-3">
-            {errorInfo.status && (
-              <p data-testid="error-status">
-                <strong>Status:</strong> {errorInfo.status}
-              </p>
-            )}
-            {errorInfo.error && (
-              <p data-testid="error-error">
-                <strong>Error:</strong> {errorInfo.error}
-              </p>
-            )}
-            {errorInfo.message && (
-              <p data-testid="error-message">
-                <strong>Message:</strong> {errorInfo.message}
-              </p>
-            )}
-            {errorInfo.path && (
-              <p data-testid="error-path">
-                <strong>Path:</strong> {errorInfo.path}
-              </p>
-            )}
-          </Alert>
-        )}
+        {true}
 
         {errorInfo?.trace && (
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:26:14
 
         {errorInfo && (
           <Alert variant="danger" className="text-start mt-3">
-            {errorInfo.status && (
-              <p data-testid="error-status">
-                <strong>Status:</strong> {errorInfo.status}
-              </p>
-            )}
+            {false}
             {errorInfo.error && (
               <p data-testid="error-error">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ErrorPage.jsx:26:14
 
         {errorInfo && (
           <Alert variant="danger" className="text-start mt-3">
-            {errorInfo.status && (
-              <p data-testid="error-status">
-                <strong>Status:</strong> {errorInfo.status}
-              </p>
-            )}
+            {errorInfo.status || <p data-testid="error-status">
+                <strong>Status:</strong> {errorInfo.status}
+              </p>}
             {errorInfo.error && (
               <p data-testid="error-error">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ErrorPage.jsx:31:14
                 <strong>Status:</strong> {errorInfo.status}
               </p>
             )}
-            {errorInfo.error && (
-              <p data-testid="error-error">
-                <strong>Error:</strong> {errorInfo.error}
-              </p>
-            )}
+            {errorInfo.error || <p data-testid="error-error">
+                <strong>Error:</strong> {errorInfo.error}
+              </p>}
             {errorInfo.message && (
               <p data-testid="error-message">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-error"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:31:14
                 <strong>Status:</strong> {errorInfo.status}
               </p>
             )}
-            {errorInfo.error && (
-              <p data-testid="error-error">
-                <strong>Error:</strong> {errorInfo.error}
-              </p>
-            )}
+            {false}
             {errorInfo.message && (
               <p data-testid="error-message">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-error"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:36:14
                 <strong>Error:</strong> {errorInfo.error}
               </p>
             )}
-            {errorInfo.message && (
-              <p data-testid="error-message">
-                <strong>Message:</strong> {errorInfo.message}
-              </p>
-            )}
+            {false}
             {errorInfo.path && (
               <p data-testid="error-path">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:36:14
                 <strong>Error:</strong> {errorInfo.error}
               </p>
             )}
-            {errorInfo.message && (
-              <p data-testid="error-message">
-                <strong>Message:</strong> {errorInfo.message}
-              </p>
-            )}
+            {true}
             {errorInfo.path && (
               <p data-testid="error-path">
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:41:14
                 <strong>Message:</strong> {errorInfo.message}
               </p>
             )}
-            {errorInfo.path && (
-              <p data-testid="error-path">
-                <strong>Path:</strong> {errorInfo.path}
-              </p>
-            )}
+            {true}
           </Alert>
         )}
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-path"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ErrorPage.jsx:41:14
                 <strong>Message:</strong> {errorInfo.message}
               </p>
             )}
-            {errorInfo.path && (
-              <p data-testid="error-path">
-                <strong>Path:</strong> {errorInfo.path}
-              </p>
-            )}
+            {errorInfo.path || <p data-testid="error-path">
+                <strong>Path:</strong> {errorInfo.path}
+              </p>}
           </Alert>
         )}
killedBy: ErrorPage tests displays error details when data has error info
statusReason: Unable to find an element by: [data-testid="error-path"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
src/main/pages/ErrorPage.jsx:49:10
           </Alert>
         )}
 
-        {errorInfo?.trace && (
+        {errorInfo.trace && (
           <div className="mt-3">
             <Button
killedBy: ErrorPage tests renders the heading and lead text
statusReason: Cannot read properties of null (reading 'trace')

[Killed] ConditionalExpression
src/main/pages/ErrorPage.jsx:49:10
           </Alert>
         )}
 
-        {errorInfo?.trace && (
-          <div className="mt-3">
-            <Button
-              variant="secondary"
-              onClick={() => setShowTrace(!showTrace)}
-              data-testid="toggle-trace-button"
-            >
-              {showTrace ? "Hide" : "Show"} Technical Details
-            </Button>
-            <Collapse in={showTrace}>
-              <div data-testid="trace-section">
-                <pre
-                  className="text-start bg-light p-3 border mt-2"
-                  style={{
-                    fontSize: "0.8em",
-                    maxHeight: "400px",
-                    overflow: "auto",
-                  }}
-                >
-                  {errorInfo.trace}
-                </pre>
-              </div>
-            </Collapse>
-          </div>
-        )}
+        {false}
 
         <div className="mt-4">
killedBy: ErrorPage tests shows toggle button when trace is present
statusReason: Unable to find an element by: [data-testid="toggle-trace-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/ErrorPage.jsx:53:43
           <div className="mt-3">
             <Button
               variant="secondary"
-              onClick={() => setShowTrace(!showTrace)}
+              onClick={() => setShowTrace(showTrace)}
               data-testid="toggle-trace-button"
             >
killedBy: ErrorPage tests clicking toggle button shows and hides technical details
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Hide Technical Details
Received:
  Show Technical Details

[Killed] ArrowFunction
src/main/pages/ErrorPage.jsx:53:24
           <div className="mt-3">
             <Button
               variant="secondary"
-              onClick={() => setShowTrace(!showTrace)}
+              onClick={() => undefined}
               data-testid="toggle-trace-button"
             >
killedBy: ErrorPage tests clicking toggle button shows and hides technical details
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Hide Technical Details
Received:
  Show Technical Details
