[Killed] StringLiteral
main/components/Utils/OurPagination.jsx:8:12
   activePage = 1,
   updateActivePage,
   totalPages = 10,
-  testId = "OurPagination",
+  testId = "",
 }) => {
   const nextPage = () => {
killedBy: OurPagination tests renders correctly for default values
statusReason: Unable to find an element by: [data-testid="/OurPagination-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:10:26
   totalPages = 10,
   testId = "OurPagination",
 }) => {
-  const nextPage = () => {
-    const newPage = Math.min(activePage + 1, totalPages);
-    updateActivePage(newPage);
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     const newPage = Math.max(activePage - 1, 1);
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:11:30
   testId = "OurPagination",
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(activePage + 1, totalPages);
+    const newPage = Math.min(activePage - 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] MethodExpression
main/components/Utils/OurPagination.jsx:11:21
   testId = "OurPagination",
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(activePage + 1, totalPages);
+    const newPage = Math.max(activePage + 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:14:26
     const newPage = Math.min(activePage + 1, totalPages);
     updateActivePage(newPage);
   };
-  const prevPage = () => {
-    const newPage = Math.max(activePage - 1, 1);
-    updateActivePage(newPage);
-  };
+  const prevPage = () => {};
   const thisPage = (page) => {
     updateActivePage(page);
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] MethodExpression
main/components/Utils/OurPagination.jsx:15:21
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(activePage - 1, 1);
+    const newPage = Math.min(activePage - 1, 1);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Timeout] ArithmeticOperator
main/components/Utils/OurPagination.jsx:15:30
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(activePage - 1, 1);
+    const newPage = Math.max(activePage + 1, 1);
     updateActivePage(newPage);
   };

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:18:30
     const newPage = Math.max(activePage - 1, 1);
     updateActivePage(newPage);
   };
-  const thisPage = (page) => {
-    updateActivePage(page);
-  };
+  const thisPage = (page) => {};
 
   const pageButton = (number) => (
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:22:22
     updateActivePage(page);
   };
 
-  const pageButton = (number) => (
-    <Pagination.Item
-      key={number}
-      active={number === activePage}
-      onClick={() => thisPage(number)}
-      data-testid={`${testId}-${number}`}
-    >
-      {number}
-    </Pagination.Item>
-  );
+  const pageButton = () => undefined;
 
   const generateSimplePaginationItems = () =>
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 3 to be 9 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:25:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === activePage}
+      active={number !== activePage}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests renders correctly for default values
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:25:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === activePage}
+      active={true}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests renders correctly for default values
statusReason: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  page-item active

[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:26:16
     <Pagination.Item
       key={number}
       active={number === activePage}
-      onClick={() => thisPage(number)}
+      onClick={() => undefined}
       data-testid={`${testId}-${number}`}
     >
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:33:41
     </Pagination.Item>
   );
 
-  const generateSimplePaginationItems = () =>
-    Array.from({ length: totalPages }, (_, index) => pageButton(index + 1));
+  const generateSimplePaginationItems = () => undefined;
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:34:65
   );
 
   const generateSimplePaginationItems = () =>
-    Array.from({ length: totalPages }, (_, index) => pageButton(index + 1));
+    Array.from({ length: totalPages }, (_, index) => pageButton(index - 1));
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected <span class="page-link" …(1)>…(1)</span> to be <a class="page-link" …(4)></a> // Object.is equality

[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:34:40
   );
 
   const generateSimplePaginationItems = () =>
-    Array.from({ length: totalPages }, (_, index) => pageButton(index + 1));
+    Array.from({ length: totalPages }, () => undefined);
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:40:9
     let middleItems;
 
     // Case 1: activePage is near the beginning (1, 2, 3, 4)
-    if (activePage < 5) {
+    if (activePage <= 5) {
       middleItems = [
         pageButton(2),
killedBy: OurPagination tests uses activePage prop to choose active button
statusReason: Unable to find an element by: [data-testid="OurPagination-6"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:40:9
     let middleItems;
 
     // Case 1: activePage is near the beginning (1, 2, 3, 4)
-    if (activePage < 5) {
+    if (false) {
       middleItems = [
         pageButton(2),
killedBy: OurPagination tests renders correctly for default values
statusReason: Found multiple elements by: [data-testid="OurPagination-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="page-link"
  data-testid="OurPagination-1"

[Killed] StringLiteral
main/components/Utils/OurPagination.jsx:48:24
         pageButton(5),
         <Pagination.Ellipsis
           key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
+          data-testid={``}
         />,
       ];
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 8 to be 9 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:53:14
       ];
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
+    else if (activePage <= totalPages - 4) {
       middleItems = [
         <Pagination.Ellipsis
killedBy: OurPagination tests uses activePage prop to choose active button
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:53:14
       ];
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
+    else if (false) {
       middleItems = [
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-11"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:59:20
           key="left-ellipsis"
           data-testid={`${testId}-left-ellipsis`}
         />,
-        pageButton(totalPages - 4),
+        pageButton(totalPages + 4),
         pageButton(totalPages - 3),
         pageButton(totalPages - 2),
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-8"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:60:20
           data-testid={`${testId}-left-ellipsis`}
         />,
         pageButton(totalPages - 4),
-        pageButton(totalPages - 3),
+        pageButton(totalPages + 3),
         pageButton(totalPages - 2),
         pageButton(totalPages - 1),
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:61:20
         />,
         pageButton(totalPages - 4),
         pageButton(totalPages - 3),
-        pageButton(totalPages - 2),
+        pageButton(totalPages + 2),
         pageButton(totalPages - 1),
       ];
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-10"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:62:20
         pageButton(totalPages - 4),
         pageButton(totalPages - 3),
         pageButton(totalPages - 2),
-        pageButton(totalPages - 1),
+        pageButton(totalPages + 1),
       ];
     }
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-11"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:66:10
       ];
     }
     // Case 3: activePage is in the middle
-    else {
-      middleItems = [
-        <Pagination.Ellipsis
-          key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
-        />,
-        pageButton(activePage - 1),
-        pageButton(activePage),
-        pageButton(activePage + 1),
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      ];
-    }
+    else {}
 
     return [pageButton(1), ...middleItems, pageButton(totalPages)];
killedBy: OurPagination tests uses activePage prop to choose active button
statusReason: middleItems is not iterable

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:72:20
           key="left-ellipsis"
           data-testid={`${testId}-left-ellipsis`}
         />,
-        pageButton(activePage - 1),
+        pageButton(activePage + 1),
         pageButton(activePage),
         pageButton(activePage + 1),
killedBy: OurPagination tests uses activePage prop to choose active button
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:74:20
         />,
         pageButton(activePage - 1),
         pageButton(activePage),
-        pageButton(activePage + 1),
+        pageButton(activePage - 1),
         <Pagination.Ellipsis
           key="right-ellipsis"
killedBy: OurPagination tests uses activePage prop to choose active button
statusReason: Found multiple elements by: [data-testid="OurPagination-4"]

Here are the matching elements:

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-4"

[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:85:35
     return [pageButton(1), ...middleItems, pageButton(totalPages)];
   };
 
-  const generatePaginationItems = () =>
-    totalPages <= 7
-      ? generateSimplePaginationItems()
-      : generateComplexPaginationItems();
+  const generatePaginationItems = () => undefined;
 
   return (
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 2 to be 9 // Object.is equality

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:86:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= 7
+    false
       ? generateSimplePaginationItems()
       : generateComplexPaginationItems();
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 9 to be 7 // Object.is equality

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:86:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= 7
+    true
       ? generateSimplePaginationItems()
       : generateComplexPaginationItems();
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 12 to be 9 // Object.is equality

[Killed] StringLiteral
main/components/Utils/OurPagination.jsx:92:56
 
   return (
     <Pagination>
-      <Pagination.Prev onClick={prevPage} data-testid={`${testId}-prev`} />
+      <Pagination.Prev onClick={prevPage} data-testid={``} />
       {generatePaginationItems()}
       <Pagination.Next onClick={nextPage} data-testid={`${testId}-next`} />
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 8 to be 9 // Object.is equality
