[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:56:27
       );
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
+    else if (activePage > totalPages + 4) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-11"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] StringLiteral
main/components/Utils/OurPagination.jsx:60:24
       paginationItems.push(
         <Pagination.Ellipsis
           key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
+          data-testid={``}
         />,
       );
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: expected 8 to be 9 // Object.is equality

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:65:39
       );
       paginationItems.push(pageButton(totalPages - 4));
       paginationItems.push(pageButton(totalPages - 3));
-      paginationItems.push(pageButton(totalPages - 2));
+      paginationItems.push(pageButton(totalPages + 2));
       paginationItems.push(pageButton(totalPages - 1));
     }
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-10"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:66:39
       paginationItems.push(pageButton(totalPages - 4));
       paginationItems.push(pageButton(totalPages - 3));
       paginationItems.push(pageButton(totalPages - 2));
-      paginationItems.push(pageButton(totalPages - 1));
+      paginationItems.push(pageButton(totalPages + 1));
     }
     // Case 3: activePage is in the middle
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-11"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:69:10
       paginationItems.push(pageButton(totalPages - 1));
     }
     // Case 3: activePage is in the middle
-    else {
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
-        />,
-      );
-      paginationItems.push(pageButton(activePage - 1));
-      paginationItems.push(pageButton(activePage));
-      paginationItems.push(pageButton(activePage + 1));
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      );
-    }
+    else {}
 
     paginationItems.push(pageButton(totalPages));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: expected 4 to be 9 // Object.is equality

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:76:39
           data-testid={`${testId}-left-ellipsis`}
         />,
       );
-      paginationItems.push(pageButton(activePage - 1));
+      paginationItems.push(pageButton(activePage + 1));
       paginationItems.push(pageButton(activePage));
       paginationItems.push(pageButton(activePage + 1));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:78:39
       );
       paginationItems.push(pageButton(activePage - 1));
       paginationItems.push(pageButton(activePage));
-      paginationItems.push(pageButton(activePage + 1));
+      paginationItems.push(pageButton(activePage - 1));
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Found multiple elements by: [data-testid="OurPagination-4"]

Here are the matching elements:

Ignored nodes: comments, script, style
<a
  class="page-link"
  data-testid="OurPagination-4"
